# 4) Даны два списка одинаковой длины. Необходимо создать из них словарь таким образом,
# чтобы элементы первого списка были ключами, а элементы второго — соответственно значениями нашего словаря.
# Результаты выведите на экран.


for i in list_1:
    for x in list_2:
        dictionary = dict(list_1, list_2)
        #print(dictionary)


